Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеЗапасов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаРасходы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеЗапасов/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ИнициализироватьДанныеДокумента")
Процедура пр_ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	ПеремещениеЗапасовЗапасы.Партия КАК Партия,
	|	ПеремещениеЗапасовЗапасы.СерийныеНомера КАК СерийныеНомера,
	|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
	|	ПеремещениеЗапасовЗапасы.Резерв КАК Резерв,
	|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПеремещениеЗапасовЗапасы.Себестоимость КАК Себестоимость,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК Сумма,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	#Вставка 
	|	ПеремещениеЗапасовЗапасы.СчетЗатрат КАК СчетЗатрат,
	#КонецВставки
	|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ВременнаяТаблицаДанныеДокумента
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовСпецоснастка.Ссылка,
	|	ПеремещениеЗапасовСпецоснастка.НомерСтроки,
	|	ПеремещениеЗапасовСпецоснастка.Номенклатура,
	|	ПеремещениеЗапасовСпецоснастка.Характеристика,
	|	ПеремещениеЗапасовСпецоснастка.Партия,
	|	"""",
	|	ПеремещениеЗапасовСпецоснастка.Количество,
	|	0,
	|	ПеремещениеЗапасовСпецоснастка.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ПеремещениеЗапасовСпецоснастка.СтранаПроисхождения,
	#Вставка 
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетЗатрат,
	#КонецВставки
	|	ПеремещениеЗапасовСпецоснастка.НомерГТД
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Спецоснастка КАК ПеремещениеЗапасовСпецоснастка
	|ГДЕ
	|	ПеремещениеЗапасовСпецоснастка.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Ссылка,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.НомерСтроки,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Номенклатура,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Характеристика,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Партия,
	|	"""",
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Количество,
	|	0,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.СтранаПроисхождения,
	#Вставка 
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) КАК СчетЗатрат,
	#КонецВставки
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.НомерГТД
	|ИЗ
	|	Документ.ПеремещениеЗапасов.ИнвентарьИХозяйственныеПринадлежности КАК ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности
	|ГДЕ
	|	ПеремещениеЗапасовИнвентарьИХозяйственныеПринадлежности.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации КАК ВидОперации,
	|	ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницу,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозвратИзРозницыСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницеСуммовойУчет,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаВРознице КАК СчетУчетаВРозницеПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаНаценки КАК СчетУчетаНаценкиПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен КАК РозничныйВидЦенПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦеныПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад КАК КоррОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета КАК ТипСчетаЗатрат,
	|	ПеремещениеЗапасовЗапасы.Ссылка.НаправлениеДеятельности КАК КоррНаправлениеДеятельности,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК КоррСтруктурнаяЕдиница,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Ячейка КАК Ячейка,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК КоррЯчейка,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК КоррСчетУчета,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Количество
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Количество * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Резерв
	|					ИНАЧЕ ПеремещениеЗапасовЗапасы.Резерв * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Резерв,
	|	0 КАК Сумма,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	&ПеремещениеЗапасов КАК Содержание,
	|	&ПеремещениеЗапасов КАК СодержаниеПроводки,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК СуммаВозвратВал,
	|	&ДатаОбновленияНаРелиз_1_2_1 КАК ДатаОбновленияНаРелиз_1_2_1
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ВременнаяТаблицаДанныеДокумента КАК ПеремещениеЗапасовЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовСерийныеНомера.КлючСвязи КАК КлючСвязи,
	|	ПеремещениеЗапасовСерийныеНомера.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ПеремещениеЗапасов.СерийныеНомера КАК ПеремещениеЗапасовСерийныеНомера
	|ГДЕ
	|	ПеремещениеЗапасовСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера";

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);

	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);

	// Временно: изменение движений по ордерному складу.
	Запрос.УстановитьПараметр("ДатаОбновленияНаРелиз_1_2_1", Константы.ДатаОбновленияНаРелиз_1_2_1.Получить());

	Запрос.УстановитьПараметр("ПеремещениеЗапасов", НСтр("ru = 'Перемещение запасов'"));

	#Вставка 
	// Данный блок предназначен переопределить получения поля СчетДТ на СчетДТ из табличной части.
	ИсходныйТекст = "
		|	ВЫБОР
		|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
		|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
		|			ТОГДА ВЫБОР
		|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
		|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
		|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
		|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
		|	КОНЕЦ КАК КоррСчетУчета";
	
	ЗаменяемыйТекст = "
		|	ВЫБОР
		|       КОГДА ПеремещениеЗапасовЗапасы.СчетЗатрат <> ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) ТОГДА ПеремещениеЗапасовЗапасы.СчетЗатрат
		|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
		|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
		|			ТОГДА ВЫБОР
		|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
		|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
		|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
		|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
		|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
		|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
		|	КОНЕЦ КАК КоррСчетУчета";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ИсходныйТекст, ЗаменяемыйТекст);
	                           
	#КонецВставки
	МассивРезультатов = Запрос.Выполнить();

	// Формирование проводок документа.
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);

	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);	

	СформироватьТаблицаУправленческий(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);

	// Расчет стоимости списания запасов.
	СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);

КонецПроцедуры
